[
{
  "model": "scraping.city",
  "pk": 1,
  "fields": {
    "name": "Казань",
    "slug": "kazan"
  }
},
{
  "model": "scraping.city",
  "pk": 4,
  "fields": {
    "name": "Москва",
    "slug": "moskva"
  }
},
{
  "model": "scraping.language",
  "pk": 1,
  "fields": {
    "name": "Python",
    "slug": "python"
  }
},
{
  "model": "scraping.language",
  "pk": 3,
  "fields": {
    "name": "Java",
    "slug": "java"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 1,
  "fields": {
    "url": "https://kazan.hh.ru/vacancy/70809271?from=vacancy_search_list&query=Python",
    "title": "Middle Python developer",
    "company": "ООО Колл-Тулз",
    "description": "Привет, кандидат!\r\n\r\nМы разрабатываем крутой сервис интерактивной телефонии — \"Звонок\" (сайт zvonok.com).\r\nВ нашу команду ищем Python - разработчика (Middle-уровня).\r\n\r\nПроект сложный и очень интересный. Вы получите опыт живой бизнес-разработки (вся обратная связь поступает моментально), опыт работы с высоконагруженными системами, практику командной работы с применением современных инструментов и подходов.\r\n\r\nВакансия в Казани, удалённая работа невозможна.\r\n\r\nПочему именно мы?\r\n\r\nУ нас действительно интересно работать;\r\nВсе наши сотрудники - профессионалы своего дела;\r\nГарантируем быстрый профессиональный рост;\r\nНаш офис находится в самом центре;\r\nМы предлагаем официальное трудоустройство, оплачиваемые отпуск, больничный;\r\nУ нас дружный коллектив, интересная корпоративная жизнь, PlayStation и пицца по пятницам.",
    "city": 1,
    "language": 1,
    "timestamp": "2022-12-16"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 2,
  "fields": {
    "url": "https://kazan.hh.ru/vacancy/73563876?from=vacancy_search_catalog&query=senior%20Python%20developer",
    "title": "Senior python developer",
    "company": "Тензор",
    "description": "Тензор – крупная российская аккредитованная IT-компания. Наш основной продукт – СБИС – сеть деловых коммуникаций. СБИС объединяет людей и компании, системы управления и учета, бизнес-процессы и документы в одной системе.\r\n\r\nМы ищем Ведущих Python-разработчиков, способных реализовывать от идеи до “продакшна” крупные проекты.\r\n\r\nПрисоединившись к нашей команде, у вас будет возможность усовершенствовать систему СБИС. Результатом вашей работы будут пользоваться более 1,5 миллиона людей – на компьютерах, планшетах и смартфонах.\r\n\r\nМы не работаем под заказ, мы создаем тиражные продукты. Используемый стек технологий: C++, Python, PostgreSQL, Javascript, NodeJS, Redis, ElasticSearch, Clickhouse. Вам не нужно знать буквально все наши технологии. Нужна светлая голова и страстное желание работать. Делать лучший продукт в России.",
    "city": 1,
    "language": 1,
    "timestamp": "2022-12-18"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 3,
  "fields": {
    "url": "https://kazan.hh.ru/vacancy/72855573?hhtmFrom=vacancy&hhtmFromLabel=vacancy_immediate_redirect",
    "title": "Fullstack разработчик",
    "company": "Сбербанк",
    "description": "В Управление исследований и инноваций Сбера ищу FullStack разработчика для создания и поддержки MVP проектов лабораторий Сбера. Лаборатории генерируют инновационные идеи, а мы помогаем их упаковать. Иногда необходимо написать API для сторонних разработчиков, иногда создать пользовательский интерфейс или полностью создать web сервис с нуля. Наша команда работает с самыми передовыми технологическими направлениями, такими как: AR/VR, искусственный интеллект, блокчейн, геймификация, кибербезопасность.",
    "city": 4,
    "language": 3,
    "timestamp": "2022-12-20"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 4,
  "fields": {
    "url": "https://kazan.hh.ru/vacancy/74015227?from=vacancy_search_list&query=Python%20backend%20developer",
    "title": "Разработчик Python (Web)",
    "company": "Growth.pet",
    "description": "Growth.pet - продукт для автоматизации и оптимизации бизнес-процессов в рынке заботы о животных.\r\n\r\nМы стартап ранней стадии с офисом в ОАЭ и целевым рынком Северной Америки.\r\n\r\nЕще до запуска продукта в листе ожидания уже более 300 компаний.\r\n\r\nВ нашей команде нет бюрократии, все нацелены на общий результат. Поэтому ты сможешь не только работать с поставленными задачами, но и предлагать идеи, которые помогут нам сделать лучший продукт на рынке.\r\n\r\nНаша самая большая ценность - это команда.\r\n\r\nМы уже собрали топовых людей, за плечами которых вывод продуктов на международные рынки, более 50 реализованных инженерных проектов, участие в международных конференциях, партнерства с крупнейшими мировыми компаниями, привлечение инвестиций и опыт успешного запуска стартапов от стадии идеи до глобальных продаж.\r\n\r\nСейчас нам нужно усилить и ускорить направление backend разработки и поэтому мы ищем двух разработчиков уровня Senior и Middle+\r\n\r\nЧего мы ждем от кандидата:\r\n\r\n- Отличные навыки веб-разработки на Python (предпочтительно FastAPI)\r\n- Опыт проектирования REST API (GraphQL будет плюсом)\r\n- Опыт работы с SQL/NoSQL базами данных\r\n- Понимание работы протоколов OAuth2/OpenID\r\n- Навыки работы с Docker-контейнерами\r\n- Опыт работы с облаками будет плюсом (мы используем GCP)\r\n- Опыт покрытия своего кода тестами (unit, integration, e2e)\r\n- Опыт и желание работать в условиях стартапа - нет, это не работа 24/7 без выходных, праздников и зарплаты. Это то лучшее, что есть в стартапах, атмосфера, амбиции, простота коммуникации, возможность быть у истоков большой истории\r\n\r\nУсловия:\r\n\r\n- Можно работать откуда угодно\r\n\r\n- Если тебе хочется в Дубай - мы поможем с релокацией",
    "city": 4,
    "language": 1,
    "timestamp": "2022-12-20"
  }
},
{
  "model": "scraping.vacancy",
  "pk": 5,
  "fields": {
    "url": "https://kazan.hh.ru/vacancy/74014519?from=vacancy_search_list&query=Java%20backend%20developer",
    "title": "Java Backend Developer",
    "company": "Nitka Technologies",
    "description": "Nitka Technologies занимается разработкой ПО для заказчиков из США и Европы и объединяет около 300 профессионалов из Восточной Европы, Северной и Южной Америки, Армении, Грузии и Казахстана.\r\n\r\nМы расширяем команду и ищем Java Backend Developer для работы над сервисом по отслеживанию заказов и доставок. Портал позволяет клиентам отслеживать и получать уведомления о текущих поставках, делать заказы и оплачивать их.\r\n\r\nЧем предстоит заниматься: разрабатывать новые функции на бэкенде и ускорить эти процессы, участвовать в переносе некоторого функционала с легаси, активно включаться в обсуждение новых функций и требований.\r\n\r\nМы предлагаем 100% удаленную работу на фул-тайм с гибким графиком.\r\n\r\nТребования:\r\n\r\nОпыт работы с Java 8 и последующими версиями\r\nУверенное знание Spring 5, включая Spring Security, Spring Data JPA, Spring Cloud\r\nОпыт работы с MySQL или другими реляционными базами данных\r\nУмение писать модульные и интеграционные тесты\r\nБазовое понимание Microsoft Azure\r\nПонимание процесса CI/CD\r\nАнглийский на уровне Intermediate или выше\r\nПлюсом будет опыт работы с Docker, архитектурой микросервисов, понимание асинхронной связи между сервисами\r\nНеобходима релокация\r\nУсловия работы:\r\n\r\nУдаленная работа\r\nПолная занятость (8 ч/день)\r\nВзаимодействие с командой из США (ежедневные созвоны)\r\nГибкий график без тайм трекеров\r\nПривлекательная компенсация в долларах США\r\nОплачиваемый отпуск, праздники",
    "city": 4,
    "language": 3,
    "timestamp": "2022-12-20"
  }
}
]
